# Option Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RegenerationAttribute..::..Option Property
RegenerationAttribute Class See Also
---
Regeneration option.
**Namespace:** Autodesk.Revit.Attributes**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public RegenerationOption Option { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Option As RegenerationOption
	Get
```

Visual C++
---
```text
public:
property RegenerationOption Option {
	RegenerationOption get ();
}
```

# See Also
RegenerationAttribute Class
Autodesk.Revit.Attributes Namespace